### Pandas basic

#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [4]:
df = pd.Series([4,8,15,16,23,42])

In [5]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [7]:
df1 = (2,3,4,5,6,7,8,9,1,10)
pd.Series(df1)

0     2
1     3
2     4
3     5
4     6
5     7
6     8
7     9
8     1
9    10
dtype: int64

#### Q3. Create a Pandas DataFrame that contains the following data:
##### Then, print the DataFrame.

In [12]:
df2 = [{"Name" :('Alice','Bob' , 'Claire'),
       "Age" : (25,30,27),
       "Gender" : ('Female' , 'Male' , 'Female')}]

In [13]:
df2

[{'Name': ('Alice', 'Bob', 'Claire'),
  'Age': (25, 30, 27),
  'Gender': ('Female', 'Male', 'Female')}]

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. The Pandas Series data structure is a one-dimensional labelled array. It is the primary building block for a DataFrame, making up its rows and columns. 
1)Series are 1-D, whereas Dataframe are 2-D. 2)Series consists of homogeneous data, whereas dataframe consists of heterogeneous data. 3)series are value mutable whereas dataframe are not.

In [16]:
import pandas as pd

# Create a DataFrame with a single column using a Python list
data = [1000, 2000, 3000, 4000, 5000]
df3 = pd.DataFrame(data, columns=['Column1'])

# Print the DataFrame
print(df3)

   Column1
0     1000
1     2000
2     3000
3     4000
4     5000

In [15]:
import pandas as pd

# Create a Pandas Series from a list
data = [1000, 2000, 3000, 4000, 5000]
s = pd.Series(data)

# Print the Series
print(s)

0    1000
1    2000
2    3000
3    4000
4    5000
dtype: int64

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

map(), apply(), and applymap().

In [18]:
data = {"a" : [1,2,3,4],
       "b" :[4,5,6,7],
       "c":["Nisha" , "Krish" , "Sudh", "Navin"]}
df22 = pd.DataFrame(data , index = ['a' , 'b' , 'c' , 'd'])

In [19]:
df22

   a  b      c
a  1  4  Nisha
b  2  5  Krish
c  3  6   Sudh
d  4  7  Navin

In [21]:
df23 = df22[['a' , 'b']]
df23

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [22]:
#applymap()

df23.applymap(lambda x : x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [23]:
df3 = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df3

   A  B
0  4  9
1  4  9
2  4  9

In [26]:
#apply

df3.apply(sum, axis=0)

A    12
B    27
dtype: int64

In [28]:
## map

s = pd.Series(['cat', 'dog',  'rabbit'])
s

0       cat
1       dog
2    rabbit
dtype: object

In [29]:
s.map({'cat': 'kitten', 'dog': 'puppy'})

0    kitten
1     puppy
2       NaN
dtype: object

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [17]:
import pandas as pd
# Create pandas Series
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)
print(df)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000